Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateRevealIntegralWarn Property
 Could not create integral reveal for wall instance. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRevealIntegralWarn { get; }
Public Shared ReadOnly Property CannotCreateRevealIntegralWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRevealIntegralWarn {
	FailureDefinitionId^ get ();
}
static member CannotCreateRevealIntegralWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace